import tkinter
import tap
import kbd
from wlib import *


# ============================================================
# 1. 設定を書く場所
# ============================================================
# ウィンドウの指定
WIDTH=480
HEIGHT=640
BG_COLOR="black"



# ============================================================
# 2. ここはライブラリ準備部分。基本的に触らない
# ============================================================
root = tkinter.Tk()
canvas = tkinter.Canvas(root, width=WIDTH, height=HEIGHT, bg=BG_COLOR)
canvas.pack()

set_canvas(canvas)
tap.bind_events(canvas)
kbd.bind_events(root)



# ============================================================
# 3. キャラクターの変数・関数を書く場所
# ============================================================



# ============================================================
# 4. ゲーム全体の初期化を書く場所 setup()
# ============================================================
frame = 0   # 開始時から何フレーム経過したかを管理

# 初期化
def setup():
    global frame
    frame = 0
    kbd.keycls()   # キーボード状態の初期化
    
    # その他の初期化用
    



# ============================================================
# 5. 毎フレーム実行する処理を書く場所 main()
# ============================================================
# メインループ
def main():
    global frame
    frame += 1

    # すべてをクリア
    canvas.delete("all")
    

    # メインループ処理用


    
    # 30fps でループ
    root.after(33, main)



    
# ----------------------------------------------------
# メイン処理（ここは変更する必要ない定番処理）
# ----------------------------------------------------
setup()           # 初期化
main()            # メインループの呼び出し
root.mainloop()   # ウィンドウが消されるのを待つ

    
